21-rails-review/app/views/ports/new.html.erb

SELECT "ships".* FROM "ships"
---
    <%=f.label :ship%>
    <%=f.collection_select :ship_ids, Ship.all, :id, :name %>