21-rails-review/app/controllers/ports_controller.rb

SELECT  "ports".* FROM "ports" WHERE "ports"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @port = Port.find(params[:id])

INSERT INTO "ports" ("docks", "location", "name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["docks", 7], ["location", "Caribbean "], ["name", "Tortuga "], ["category", "Big Port "], ["created_at", "2019-07-25 16:36:19.097255"], ["updated_at", "2019-07-25 16:36:19.097255"]]
---
    def create
        byebug
        @port = Port.new(port_params)
        @port.save