21-rails-review/app/controllers/ships_controller.rb

INSERT INTO "ships" ("crew_size", "name", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["crew_size", 267], ["name", "Black Pearl"], ["category", "Ghost Ship"], ["created_at", "2019-07-25 16:01:03.242130"], ["updated_at", "2019-07-25 16:01:03.242130"]]
---
    def create
        byebug
        @ship = Ship.new(ship_params)
        if @ship.save

SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def find_ship
        @ship = Ship.find(params[:id])