21-rails-review/app/models/ship.rb

SELECT "dockings".* FROM "dockings" WHERE "dockings"."ship_id" = ?  [["ship_id", 6]]
---
    def current_docking
        self.dockings.select do |docking|